{
    
    "schema": "1.0",
    "type": "whmcs-provisioning",
    "name": "reportgenerator",
    "license": "proprietary",
    "category": "provisioning",
    "description": {
        "name": "Report Generator",
        "tagline": "Build dynamic reports, schedule their creation and email the results to your staff members.",
        "short": "Build dynamic reports, schedule their creation and email the results to your staff members.",
        "long": "Report Generator For WHMCS will let you preview numerous ready-made reports, and also generate custom ones using any type of WHMCS data. You will be free to export, print, and compare reports, display them in a table, graph, or chart form, as well as apply various filters, or even your own PHP code to receive expected results. Furthermore, the module will allow you to schedule creating and sending selected reports, both predefined and custom ones, either via email, or to an FTP/SFTP server.\nWhether you are fluent in SQL, or have never heard of it, Report Generator For WHMCS will adjust to your skills by offering two different types of inbuilt creators, each equipped with a tidily arranged, user-friendly interface. The module provides the choice of over 30 reports prepared for immediate use, that you can further filter to obtain the exact figures you seek. If you own our CRM For WHMCS, you will be granted access to 4 exclusive insights into your customer relationships as well.\nNo matter if you are a web hosting provider, a domains reseller, or use WHMCS in any other way - Report Generator For WHMCS will help you x-ray your company to draw sure-fire conclusions, and shoot up your income.  "

    },
    "logo": {
        "filename": "logo.png"
    },
    "support": {
        "homepage": "https://www.modulesgarden.com/products/whmcs/report-generator",
        "learn_more": "https://www.modulesgarden.com/products/whmcs/report-generator#features",
        "support_url": "https://www.modulesgarden.com/support",
        "docs_url": "https://www.docs.modulesgarden.com/Report_Generator_For_WHMCS"
    },
    "marketplace": {
        "url": "https:\/\/marketplace.whmcs.com\/product\/1362"
    },

    "authors": [
    {
        "name": "ModulesGarden",
        "homepage": "https://www.modulesgarden.com/"
    }
    ]
    
     
}